{
    "ArgumentOption": "Enter the argument you would like to use for this app item. For example, \"-n\" could be used for the Input File Selector.",
    "CharacterLimit": "Allows you to set the maximum number of characters the user may enter.",
    "DefaultValue": "The default value you enter here is what value the user first sees. The app will use that value by default.",
    "Double": "Adds a field where the user can enter a decimal or large integer where you can set upper and lower limits, or a range of values that the app will accept.",
    "DoubleAbove": "Allows you to set a lower limit (non-inclusive) to the value the user may enter.",
    "DoubleBelow": "Allows you to set an upper limit (non-inclusive) to the value the user may enter.",
    "DoubleRange": "Allows you to restrict the value that the user may enter to a range of values (inclusive).",
    "DoubleSelection": "Inserts a list of decimals you define from which the user can select one item.",
    "EnvironmentVariable": "Allows you to set a dynamic named value that affect the execution environment of the app.",
    "EnvironmentVariableDefaultName": "The name you enter here will be the name of the Environment Variable set by the app before the command line tool is run.",
    "EnvironmentVariableDefaultValue": "The text you enter here will be what the user sees in this field when they first open the app; the \"default\" value for the environment variable name you have entered.",
    "ExcludeArgument": "Selecting this option will \"skip\" this app item when the app is used (the argument will not be passed to the command line).",
    "FileInput": "Adds an input file field that allows users to browse their data and select <i>one</i> input file.",
    "FileOutput": "Allow the user to name the file containing the results the app generates. You may also set a default output name.",
    "Flag": "Inserts a checkbox. You can set whether it is checked or unchecked by default.",
    "FolderInput": "<p>Adds an input folder field that allows users to browse their data and select one <i>folder</i> as their input.</p><p><i>Note:</i> The input folder selector is not for submitting batch data where an analysis is performed for each file within the folder. The folder selector is specifically for binary that accepts the entire folder as <i>one</i> argument item.</p>",
    "FolderOutput": "Allow the user to name the folder containing the results the app generates. You may also set a default output name.",
    "HelpText": "Displays below the parameter field (just like this text), containing helpful information for this particular app item. This is useful for new users of your app and is recommended.",
    "Info": "Allows you to display informative or descriptive information to the user of your app. This text is only displayed and is not passed to the command line.",
    "Integer": "Adds a field that allows the user to enter an integer where you can set upper and lower limits, or a range of values that the app will accept.",
    "IntAbove": "Allows you to set a lower limit (non-inclusive) to the value the user may enter.",
    "IntBelow": "Allows you to set an upper limit (non-inclusive) to the value the user may enter.",
    "IntRange": "Allows you to restrict the value that the user may enter to a range of values (inclusive).",
    "IntegerSelection": "Inserts a list of integers you define from which the user can select one item.",
    "IsImplicitFileInput": "Selecting this option allows the app user to select input files without those files being included in the command line.",
    "IsImplicitFolderInput": "Selecting this option allows the app user to select input folders without those folders being included in the command line.",
    "MultiFileOutput": "Allow the user to name the file containing the results the app generates. You may also set a default output name.",
    "MultiFileSelector": "Adds an input file field that allows users to browse their data and select <i>one or many</i> input files to use. As the integrator, you can specify the type of files that the user may use.",
    "MultiLineText": "Similar to Single-line Text, except the user may enter more than one line of text.",
    "ReferenceAnnotation": "<p>Allow you to add drop-down lists of a <b>Reference Annotation</b> from which the user can make one selection.</p><p>The Discovery Environment has reference annotations uploaded and available for use.</p><p>To add a reference species that is not currently supported, please email the CyVerse support team at support@cyverse.org.</p>",
    "ReferenceGenome": "<p>Allow you to add drop-down lists of a <b>Reference Genome</b> from which the user can make one selection.</p><p>The Discovery Environment has reference genomes uploaded and available for use.</p><p>To add a reference species that is not currently supported, please email the CyVerse support team at support@cyverse.org.</p>",
    "ReferenceSequence": "<p>Allow you to add drop-down lists of a <b>Reference Sequence</b> from which the user can make one selection.</p><p>The Discovery Environment has reference sequences uploaded and available for use.</p><p>To add a reference species that is not currently supported, please email the CyVerse support team at support@cyverse.org.</p>",
    "Regex": "Indicates that the text the user enters must match the expression you define.",
    "Section": "<p>An app can contain multiple <b>sections</b> that appear as collapsible panels to help organize the app's content.</p><p>For example, you may have one section labeled \"Inputs\" where users select their input data, as well as an \"Options\" section where users select from the various options you have created for your app.</p>",
    "Text": "Will display a text box the user may enter information into. You can also set informative or descriptive default \"background\" text to display in the text box.",
    "TextSelection": "Adds a drop-down list from which the user can make one selection from the options you define.",
    "TextSelectionEditor": "<p>This section is where you will build your list.</p><p>Click \"Add\", then edit the text in the \"Display\" column to what you would like the user to actually see. Assign an argument to that Display item in the \"Argument\" column, for example \"-n\", then enter that list item's value in the \"Value\" column, such as \"5\".</p><p>When the user clicks that display text in the drop-down, it will be associated with the argument and its value you assigned and will be passed to the command line.</p><p>To select which item you wish to automatically display, select an item from the \"Default value\" list.</p>",
    "ToolUsed": "<p>A <b>tool</b> is the software program (binary or script) that is installed on a server and integrated into the backend of the Discovery Environment (DE) for use in DE apps.</p><p>An <b>app</b> is the <i>interface</i> of a tool that has been configured and made available for use in the DE.</p><p>The same <i>tool</i> can be used in more than one <i>app</i>, but an app is created by different integrators with different intentions from that same tool.</p>",
    "validationRules": "<p><b>Validation rules</b> are the rules you define describing what value the user may enter that will successfully execute the app. If a user enters a value that does not follow the rules you set, the app will display a warning with explanation and not launch the app.</p>"
}
