{
    "admin": "Admin",
    "allTeams": "All Teams",
    "ariaTeamFilter": "Team Filter",
    "createTeamFail": "Failed to create team name or description. Please try again.",
    "creator": "Creator Name",
    "deleteTeamFail": "Failed to delete team.  Please try again.",
    "deleteTeamTitle": "Delete team {{name}}?",
    "deleteTeamText": "Deleting a team means anything shared with the team will no longer be shared with any of the team members, including yourself. Do you wish to continue deleting the team?",
    "description": "Description",
    "emptyTeamName": "Team name cannot be empty",
    "getTeamFail": "Failed to get team details.  Please try again.",
    "helpText": "<p>Teams allow you to create, organize, and join public or private groups of collaborators.</p><p>You can share apps or tools with Teams, but not data.</p><p>Any teams you are a member of will show up under \"My Teams\". Find other public teams that you can join by selecting \"All Teams\".</p><p>You can create your own Team and define Team members and Team privileges by selecting \"Create Team\".</p>",
    "invalidTeamName": "Team name cannot contain `{{invalidCharList}}`. Invalid characters: `{{invalidChars}}`",
    "join": "Join",
    "joinDlgInfo": "By completing this form, you are submitting a request to the admin of {{name}} to join the team. You can optionally add a short message to attach to your request below.",
    "joinDlgLabel": "Message to Team Admin",
    "joinDlgTitle": "Request to join team {{name}}",
    "leave": "Leave",
    "leaveTeamFail": "Failed to leave team.  Please try again.",
    "leaveTeamText": "Leaving a team means anything shared with the team will no longer be shared with you, however, anything you have shared with the team will remain shared with the team. Do you wish to continue leaving the team?",
    "leaveTeamTitle": "Leave Team {{name}}?",
    "memberHelpMessage": "Being a member means anything shared with the team is also shared with you. Likewise, you can share items with the team and all the members will have access to those items. If a member decides to leave a team (which members can do at any time), items shared with the team will no longer be shared with that member.",
    "members": "Members",
    "myTeams": "My Teams",
    "name": "Name",
    "noTeams": "No teams",
    "privilege": "Privilege",
    "publicTeam": "Public Team",
    "publicTeamHelp": "Making your team public allows your team to be discoverable to other CyVerse users who are not members of your team. Allowing users to discover your team will enable them to view the team and request to join. A team can be updated from public to private and vice versa any time.",
    "read": "Member",
    "remove": "Remove",
    "team": "Team",
    "teamDesc": "Team Description",
    "teamName": "Team Name",
    "updateTeamFail": "Failed to update team name or description.  Please try again.",
    "updateTeamMemberStatsFail": "Failed to update team members or privileges.  Please try again.",
    "view": "View"
}
